OpenFOAM-6-AP/tutorials/lagrangian/reactingParcelFoam/splashPanel/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    location    "0";
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedValue;
        value           uniform 300;
    }
}

// ************************************************************************* //
